<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"40a64d1e57f48735882472dc0c041fc6b8c108a113afbfcb060bc3f10f447002","plan_job_ref":"Job Plan Terraform #17 at https://github.com/Decatur-Robotics/Gearbox-Terraform/actions/runs/13189165677","plan_out_hash":"3afdd14d3f1ff5353cbc79611c56b9721d9fd721673122e24124d71fc03ed43c","plan_hash":"bb176b409e8c08c123e4c56755dd02802b267fb4538ae3297a22b1e3be985a4e","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan in __.__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudflare_dns_record.status-cname will be updated in-place
!~  resource "cloudflare_dns_record" "status-cname" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      content             = "gearbox-980962066.us-east-1.elb.amazonaws.com" -> "app.pulsetic.com"
!~      created_on          = "2025-02-03T22:20:13Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "8414401feaf9313a5eea18d32c031a8e"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-02-06T22:28:41Z" -> (known after apply)
        name                = "status"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
!~          flatten_cname = false -> (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (4 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform #17](https://github.com/Decatur-Robotics/Gearbox-Terraform/actions/runs/13189165677)